export default function Home() {
  return (
    <main className="container section">
      <div>
        <p>
          Магический квадрат — это квадратная матрица чисел, в которой сумма
          чисел в каждой строке, каждом столбце и на обеих диагоналях одинакова.
          Например, в магическом квадрате 3x3 числа от 1 до 9 можно расставить
          так, что сумма чисел в каждом ряду, каждом столбце и на обеих
          диагоналях будет равна 15.
        </p>
        <p>
          Магические квадраты имеют множество интересных свойств и применений в
          математике, искусстве и даже в магии и гаданиях. Например, они могут
          быть использованы в криптографии или для решения головоломок.
        </p>
      </div>
    </main>
  );
}
